app/controllers/chefs_controller.rb

  def index
    @chefs = Chef.all
---
SELECT "chefs".* FROM "chefs"

  def show
    @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def edit
    @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]