app/controllers/chefs_controller.rb

  def create
    # binding.pry
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]