app/controllers/restaurants_controller.rb

  def chefs
    @chefs = Chef.where(restaurant_id: params[:id])
    @restaurant = Restaurant.find(params[:id])
---
SELECT "chefs".* FROM "chefs" WHERE "chefs"."restaurant_id" = $1  [["restaurant_id", 9]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]