app/controllers/suppliers_controller.rb

SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @supplier = Supplier.find(params[:id])

SELECT "supply_trucks".* FROM "supply_trucks" WHERE "supply_trucks"."supplier_id" = $1  [["supplier_id", 4]]
SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def supply_trucks
    @supply_trucks = SupplyTruck.where(supplier_id: params[:id])
    @supplier = Supplier.find(params[:id])