app/controllers/suppliers_controller.rb

SELECT "suppliers".* FROM "suppliers"
---
  def index
    @suppliers = Supplier.all