app/controllers/supply_trucks_controller.rb

  def index
    @supply_trucks = SupplyTruck.all
---
SELECT "supply_trucks".* FROM "supply_trucks"

  def show
    @supply_truck = SupplyTruck.find(params[:id])
---
SELECT  "supply_trucks".* FROM "supply_trucks" WHERE "supply_trucks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]