app/views/suppliers/supply_trucks.html.erb

SELECT "supply_trucks".* FROM "supply_trucks" WHERE "supply_trucks"."supplier_id" = $1  [["supplier_id", 6]]
---
<%= link_to "Sort Supply Trucks By Name", "/suppliers/#{@supplier.id}/sorted" %>
<% @supplier.supply_trucks.each do |supply_truck| %>